logs/resultados/20_100_autocannon_result_info.txt
Running 20s test @ http://localhost:8080/info
100 connections


┌─────────┬─────────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%    │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼─────────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 1467 ms │ 1676 ms │ 2879 ms │ 2998 ms │ 1788.89 ms │ 396.07 ms │ 3123 ms │
└─────────┴─────────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────┬──────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 91      │ 92      │ 84.15   │ 23.36   │ 89      │
├───────────┼─────┼──────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 51.6 kB │ 52.2 kB │ 47.7 kB │ 13.2 kB │ 50.5 kB │
└───────────┴─────┴──────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 14

1k requests in 22.03s, 668 kB read
null {
title: undefined,
url: 'http://localhost:8080/info',
socketPath: undefined,
connections: 100,
sampleInt: 1000,
pipelining: 1,
workers: undefined,
duration: 22.03,
samples: 14,
start: 2022-08-17T02:38:42.168Z,
finish: 2022-08-17T02:39:04.196Z,
errors: 0,
timeouts: 0,
mismatches: 0,
non2xx: 0,
resets: 0,
'1xx': 0,
'2xx': 1178,
'3xx': 0,
'4xx': 0,
'5xx': 0,
statusCodeStats: { '200': { count: 1178 } },
latency: {
average: 1788.89,
mean: 1788.89,
stddev: 396.07,
min: 1467,
max: 3123,
p0_001: 1467,
p0_01: 1467,
p0_1: 1467,
p1: 1467,
p2_5: 1467,
p10: 1472,
p25: 1535,
p50: 1676,
p75: 1751,
p90: 2683,
p97_5: 2879,
p99: 2998,
p99_9: 3123,
p99_99: 3123,
p99_999: 3123,
totalCount: 1178
},
requests: {
average: 84.15,
mean: 84.15,
stddev: 23.36,
min: 89,
max: 92,
total: 1178,
p0_001: 0,
p0_01: 0,
p0_1: 0,
p1: 0,
p2_5: 0,
p10: 89,
p25: 90,
p50: 91,
p75: 91,
p90: 92,
p97_5: 92,
p99: 92,
p99_9: 92,
p99_99: 92,
p99_999: 92,
sent: 1278
},
throughput: {
average: 47708.58,
mean: 47708.58,
stddev: 13241.72,
min: 50458,
max: 52162,
total: 667929,
p0_001: 0,
p0_01: 0,
p0_1: 0,
p1: 0,
p2_5: 0,
p10: 50463,
p25: 51007,
p50: 51615,
p75: 51615,
p90: 52159,
p97_5: 52191,
p99: 52191,
p99_9: 52191,
p99_99: 52191,
p99_999: 52191
}
}