logs/resultados/20_100_autocannon_result_randoms.txt
Running 20s test @ http://localhost:8080/api/randoms
100 connections


┌─────────┬───────────┬───────────┬───────────┬───────────┬───────────┬─────────┬───────────┐
│ Stat    │ 2.5%      │ 50%       │ 97.5%     │ 99%       │ Avg       │ Stdev   │ Max       │
├─────────┼───────────┼───────────┼───────────┼───────────┼───────────┼─────────┼───────────┤
│ Latency │ 129916 ms │ 129917 ms │ 129918 ms │ 129918 ms │ 129917 ms │ 0.83 ms │ 129923 ms │
└─────────┴───────────┴───────────┴───────────┴───────────┴───────────┴─────────┴───────────┘
┌───────────┬─────┬──────┬─────┬─────────┬────────┬────────┬─────────┐
│ Stat      │ 1%  │ 2.5% │ 50% │ 97.5%   │ Avg    │ Stdev  │ Min     │
├───────────┼─────┼──────┼─────┼─────────┼────────┼────────┼─────────┤
│ Req/Sec   │ 0   │ 0    │ 0   │ 100     │ 50     │ 50     │ 100     │
├───────────┼─────┼──────┼─────┼─────────┼────────┼────────┼─────────┤
│ Bytes/Sec │ 0 B │ 0 B  │ 0 B │ 1.66 MB │ 832 kB │ 832 kB │ 1.66 MB │
└───────────┴─────┴──────┴─────┴─────────┴────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 2

296 requests in 135.25s, 1.66 MB read
null {
title: undefined,
url: 'http://localhost:8080/api/randoms',
socketPath: undefined,
connections: 100,
sampleInt: 1000,
pipelining: 1,
workers: undefined,
duration: 135.25,
samples: 2,
start: 2022-08-17T02:40:30.789Z,
finish: 2022-08-17T02:42:46.036Z,
errors: 0,
timeouts: 0,
mismatches: 0,
non2xx: 0,
resets: 0,
'1xx': 0,
'2xx': 100,
'3xx': 0,
'4xx': 0,
'5xx': 0,
statusCodeStats: { '200': { count: 100 } },
latency: {
average: 129917,
mean: 129917,
stddev: 0.83,
min: 129916,
max: 129923,
p0_001: 129916,
p0_01: 129916,
p0_1: 129916,
p1: 129916,
p2_5: 129916,
p10: 129916,
p25: 129917,
p50: 129917,
p75: 129917,
p90: 129918,
p97_5: 129918,
p99: 129918,
p99_9: 129923,
p99_99: 129923,
p99_999: 129923,
totalCount: 100
},
requests: {
average: 50,
mean: 50,
stddev: 50,
min: 100,
max: 100,
total: 100,
p0_001: 0,
p0_01: 0,
p0_1: 0,
p1: 0,
p2_5: 0,
p10: 0,
p25: 0,
p50: 0,
p75: 100,
p90: 100,
p97_5: 100,
p99: 100,
p99_9: 100,
p99_99: 100,
p99_999: 100,
sent: 296
},
throughput: {
average: 831744,
mean: 831744,
stddev: 831744,
min: 1663519,
max: 1663519,
total: 1663519,
p0_001: 0,
p0_01: 0,
p0_1: 0,
p1: 0,
p2_5: 0,
p10: 0,
p25: 0,
p50: 0,
p75: 1663999,
p90: 1663999,
p97_5: 1663999,
p99: 1663999,
p99_9: 1663999,
p99_99: 1663999,
p99_999: 1663999
}