logs/resultados/20_50_artillery_result_info.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 23:18:54(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:18:55(-0300)

All VUs finished. Total time: 20 seconds

--------------------------------
Summary report @ 23:19:12(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 28/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 120
  max: ......................................................................... 532
  median: ...................................................................... 320.6
  p95: ......................................................................... 424.2
  p99: ......................................................................... 450.4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15808
  max: ......................................................................... 16620.8
  median: ...................................................................... 16486.1
  p95: ......................................................................... 16486.1
  p99: ......................................................................... 16486.1