logs/resultados/20_50_artillery_result_randoms.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 23:21:02(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 23:21:03(-0300)

All VUs finished. Total time: 25 seconds

--------------------------------
Summary report @ 23:21:25(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.codes.200: ................................................................ 7
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 27
http.response_time:
  min: ......................................................................... 1358
  max: ......................................................................... 9163
  median: ...................................................................... 5272.4
  p95: ......................................................................... 7865.6
  p99: ......................................................................... 7865.6
http.responses: ................................................................ 7
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 20